app/views/programmes/index.html.erb

          <div id="programme-client-count">
            <p>Total Clients: <%= programme.clients.count %></p>
---
SELECT COUNT(*) FROM "clients" INNER JOIN "clients_programmes" ON "clients"."id" = "clients_programmes"."client_id" WHERE "clients_programmes"."programme_id" = ?  [["programme_id", 1]]