app/views/programmes/show.html.erb

<ul>
  <% @programme.clients.each do |client| %>
---
SELECT "clients".* FROM "clients" INNER JOIN "clients_programmes" ON "clients"."id" = "clients_programmes"."client_id" WHERE "clients_programmes"."programme_id" = ?  [["programme_id", 6]]