app/views/organisations/show.html.erb

<h4>Current Programmes</h4>
  <% @organisation.programmes.each do |programme| %>
---
SELECT "programmes".* FROM "programmes" WHERE "programmes"."organisation_id" = ?  [["organisation_id", 1]]