app/views/clients_programmes/index.html.erb

SELECT  "clients".* FROM "clients" LIMIT ?  [["LIMIT", 1]]
---

<p><%= @clients_programmes.each {|cp| puts cp.client_id } %></p>