app/views/clients/new.html.erb

SELECT "clients".* FROM "clients"
---
<%= bootstrap_form_for([@programme, @client]) do |f| %>
  <%= f.collection_select(:full_name, Client.all, :id, :full_name, {prompt: true}, {name: 'client[id]'}) %>