app/views/clients/show.html.erb

SELECT "clients_programmes".* FROM "clients_programmes" WHERE "clients_programmes"."client_id" = ?  [["client_id", 3]]
---
<% else %>
  <% @client.clients_programmes.each do |clients_programme| %>