app/views/clients/show.html.erb

SELECT "programmes".* FROM "programmes" INNER JOIN "clients_programmes" ON "programmes"."id" = "clients_programmes"."programme_id" WHERE "clients_programmes"."client_id" = ?  [["client_id", 13]]
---
<p><b><%= @client.first_name %></b> is registered to participate in the following Programmes:</p>
  <% @client.programmes.each do |programme| %>

SELECT "outcomes".* FROM "outcomes" WHERE "outcomes"."client_id" = ?  [["client_id", 1]]
---

<p><% @client.outcomes.each do |outcome| %>