app/views/outcomes/index.html.erb

SELECT "outcomes".* FROM "outcomes" WHERE "outcomes"."client_id" = ?  [["client_id", 23]]
---
<h2>Outcomes</h2>
<% @client.outcomes.each do |outcome| %>