app/controllers/clients_controller.rb

SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @programme = Programme.find(params[:programme_id])