app/controllers/clients_programmes_controller.rb

  def show
    @clients_programme = ClientsProgramme.find(params[:id])
---
SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clients_programmes".* FROM "clients_programmes" WHERE "clients_programmes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def new
    @client = Client.find(params[:client_id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @clients_programme = ClientsProgramme.new(clients_programme_params)
    # byebug
    @clients_programme.save
---
INSERT INTO "clients_programmes" ("programme_term", "programme_year", "client_status", "client_id", "programme_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @clients_programme = ClientsProgramme.find(params[:id])
---
SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clients_programmes".* FROM "clients_programmes" WHERE "clients_programmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @clients_programme = ClientsProgramme.find(params[:id])
    @clients_programme.update(client_status_params)
---
SELECT  "clients_programmes".* FROM "clients_programmes" WHERE "clients_programmes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "clients_programmes" SET "client_status" = ?, "updated_at" = ? WHERE "clients_programmes"."id" = ?  [["client_status", 0], ["updated_at", "2019-04-02 15:56:59.694107"], ["id", 2]]