app/controllers/clients_programmes_controller.rb

  def index
    @clients_programmes = ClientsProgramme.all
---
SELECT  "clients_programmes".* FROM "clients_programmes" LIMIT ?  [["LIMIT", 1]]