app/controllers/clients_controller.rb

SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @programme = Programme.find(params[:programme_id])

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "clients".* FROM "clients" INNER JOIN "clients_programmes" ON "clients"."id" = "clients_programmes"."client_id" WHERE "clients_programmes"."programme_id" = ?  [["programme_id", 2]]
SELECT  "clients_programmes".* FROM "clients_programmes" WHERE "clients_programmes"."client_id" = ? AND "clients_programmes"."programme_id" = ? LIMIT ?  [["client_id", 1], ["programme_id", 1], ["LIMIT", 1]]
---
  def show
    @client = Client.find(params[:id])
    @programme = @client.clients_programmes.find_by(programme_id: params[:programme_id])

SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def new
    @programme = Programme.find(params[:programme_id])

SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "clients" ("first_name", "last_name", "email", "phone", "city", "post_code", "address1", "address2", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "clients_programmes" SET "programme_term" = ?, "updated_at" = ? WHERE "clients_programmes"."id" = ?  [["programme_term", ""], ["updated_at", "2019-04-05 10:19:47.882390"], ["id", 10]]
SELECT  "clients_programmes".* FROM "clients_programmes" WHERE "clients_programmes"."client_id" = ? ORDER BY "clients_programmes"."id" DESC LIMIT ?  [["client_id", 9], ["LIMIT", 1]]
---
  def create
    @programme = Programme.find(params[:programme_id])
    # raise params.inspect
    @client = Client.find_by(id: client_params[:id]) || Client.new(client_params)
    if @client.id
      flash[:notice] = "Your Client has been added to #{@programme.title}"
      val =  "Your Client has been added to #{@programme.title}"
    elsif @client.save
      flash[:notice] = "Your Client was Created"
      val =  "Your Client was Created"
    else
      render :new
      val =  'in else block'
    end
    # byebug
    @client.programmes << @programme
    ClientsProgramme.last.update(client_status_params)