app/controllers/organisations_controller.rb

SELECT "organisations".* FROM "organisations"
---
    def index
      @organisations = Organisation.all

SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @organisation = Organisation.find(params[:id])

INSERT INTO "organisations" ("name", "created_at", "updated_at", "website") VALUES (?, ?, ?, ?)  [["name", "Nova New Opportunities"], ["created_at", "2019-03-31 21:14:50.882880"], ["updated_at", "2019-03-31 21:14:50.882880"], ["website", "www.novanew.org.uk"]]
---
    def create
      @organisation = Organisation.new(org_params)
      if @organisation.save