app/controllers/outcomes_controller.rb

  def index
    @outcomes = Outcome.all
    @client = Client.find(params[:client_id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]

  def show
    @outcome = Outcome.find(params[:id])
    @client = Client.find(params[:client_id])
---
SELECT  "outcomes".* FROM "outcomes" WHERE "outcomes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def new
    @client = Client.find(params[:client_id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def create
    @client = Client.find(params[:client_id])
    @outcome = @client.outcomes.build(outcome_params)
    if @outcome.save
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "outcomes" ("description", "grade", "created_at", "updated_at", "client_id") VALUES (?, ?, ?, ?, ?)  [["description", "amazing"], ["grade", 100], ["created_at", "2019-04-03 17:44:46.472667"], ["updated_at", "2019-04-03 17:44:46.472667"], ["client_id", 1]]