app/controllers/programmes_controller.rb

  def index
    @programmes = Programme.all
---
SELECT "programmes".* FROM "programmes"