app/controllers/programmes_controller.rb

SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @organisation = Organisation.find(params[:organisation_id])

SELECT  "programmes".* FROM "programmes" WHERE "programmes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @programme = Programme.find(params[:id])

SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @organisation = Organisation.find(params[:organisation_id])

SELECT  "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "programmes" ("title", "organisation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computers"], ["organisation_id", 1], ["created_at", "2019-04-05 10:25:43.703300"], ["updated_at", "2019-04-05 10:25:43.703300"]]
---
  def create
    @organisation = Organisation.find(params[:organisation_id])
    @programme = @organisation.programmes.build(programme_params)
    if @programme.save!